src/cf/Catalogs/КлючиРеквизитовПервичныхДокументовЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КлючиРеквизитовПервичныхДокументовЗЕРНО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.ТипыПервичныхДокументовЗЕРНО</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторНСИЗЕРНО</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторВЕТИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ТипыПервичныхДокументовЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПервичныхДокументовЗЕРНО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосКонтракт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрактВЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товаросопроводительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколИсследований</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОтбораПроб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДекларацияСоответствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВетеринарныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФитосанитарныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыКлассификаторовЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыКлассификаторовЗЕРНО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПотребительскоеСвойство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПричинаСписания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидОтбораПроб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидТранспортногоСредства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПричинаРасхожденияВеса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначениеПотребительскогоСвойства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументНаПартию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПричинаВозвратаПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпособПереработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦельИспользованияПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОКПД2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТНВЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопустимыеЗначенияПотребительскихСвойств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипУслугиЭлеватора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидСельскохозяйственнойКультуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/КлючиРеквизитовПервичныхДокументовЗЕРНО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПоискСсылок

Функция КлючПервичногоДокумента(ИсходныеДанные, ИмяПоля, Организация, Подразделение, ПараметрыОбмена, ИсходныеДанныеЯвляютсяОбъектом = Ложь) Экспорт
	
	Если ИсходныеДанныеЯвляютсяОбъектом Тогда
		ДанныеДокумента = ИсходныеДанные;
	Иначе
		ДанныеДокумента = ИсходныеДанные[ИмяПоля];
	КонецЕсли;
	
	Если ДанныеДокумента = Неопределено Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;
	
	ИмяТаблицы = Метаданные.Справочники.КлючиРеквизитовПервичныхДокументовЗЕРНО.ПолноеИмя();
	
	ДанныеПервичногоДокумента = ДанныеПервичногоДокумента(ДанныеДокумента, ИмяПоля, Организация, Подразделение, ПараметрыОбмена);
	Если Не ЗначениеЗаполнено(ДанныеПервичногоДокумента.Идентификатор) Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;
	
	СправочникСсылка = ИнтеграцияЗЕРНОСлужебный.СсылкаПоИдентификатору(
		ПараметрыОбмена, ИмяТаблицы, ДанныеПервичногоДокумента.Идентификатор);
	
	Если Не ЗначениеЗаполнено(СправочникСсылка) Тогда
		
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицы);
		ЭлементБлокировки.УстановитьЗначение("Идентификатор", ДанныеПервичногоДокумента.Идентификатор);
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка.Заблокировать();
			
			СправочникСсылка = ИнтеграцияЗЕРНОСлужебный.СсылкаПоИдентификатору(ПараметрыОбмена, ИмяТаблицы, ДанныеПервичногоДокумента.Идентификатор);
			
			Если Не ЗначениеЗаполнено(СправочникСсылка) Тогда
				СправочникСсылка = ЗагрузитьКлючПервичногоДокумента(ДанныеПервичногоДокумента, ПараметрыОбмена,, Ложь);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Ошибка при создании справочника %1 с идентификатором %2:
				           |%3'"),
				Метаданные.Справочники.КлючиРеквизитовПервичныхДокументовЗЕРНО.Синоним,
				ДанныеПервичногоДокумента.Идентификатор,
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ТекстОшибкиПодробно = СтрШаблон(
				НСтр("ru = 'Ошибка при создании справочника %1 с идентификатором %2:
				           |%3'"),
				Метаданные.Справочники.КлючиРеквизитовПервичныхДокументовЗЕРНО.Синоним,
				ДанныеПервичногоДокумента.Идентификатор,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ОбщегоНазначенияИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(
				ТекстОшибкиПодробно,
				НСтр("ru = 'Работа с ключами первичных документов'", ОбщегоНазначения.КодОсновногоЯзыка()));
			
			ВызватьИсключение ТекстОшибки;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат СправочникСсылка;
	
КонецФункции

Функция ЗагрузитьКлючПервичногоДокумента(ДанныеДокумента, ПараметрыОбмена, СуществующийОбъект = Неопределено, ТребуетсяПоиск = Истина) Экспорт
	
	ЗаписьНового       = Ложь;
	МетаданныеЭлемента = Метаданные.Справочники.КлючиРеквизитовПервичныхДокументовЗЕРНО;
	Идентификатор      = ДанныеДокумента.Идентификатор;
	
	Если СуществующийОбъект = Неопределено Тогда
		
		СуществующийЭлемент = Неопределено;
		Если ТребуетсяПоиск Тогда
			СуществующийЭлемент = ИнтеграцияЗЕРНОСлужебный.СсылкаПоИдентификатору(
				ПараметрыОбмена,
				МетаданныеЭлемента.ПолноеИмя(),
				Идентификатор);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СуществующийЭлемент) Тогда
			СуществующийОбъект = СоздатьЭлемент();
			СуществующийОбъект.Идентификатор = Идентификатор;
			СуществующийОбъект.ТипДокумента  = ДанныеДокумента.ТипДокумента;
			ЗаписьНового = Истина;
		Иначе
			СуществующийОбъект = СуществующийЭлемент.ПолучитьОбъект();
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗаписьНового Тогда
		СуществующийОбъект.Заблокировать();
	КонецЕсли;
	
	ЭлементДанных = ДанныеДокумента.Данные;
	
	ДанныеНаименования = Новый Массив();
	
	Если СуществующийОбъект.ТипДокумента = Перечисления.ТипыПервичныхДокументовЗЕРНО.ДоговорХранения Тогда
		СуществующийОбъект.Дата  = ЭлементДанных.dateDogovor;
		СуществующийОбъект.Номер = ЭлементДанных.numberDogovor;
	Иначе
		СуществующийОбъект.Дата  = ЭлементДанных.date;
		СуществующийОбъект.Номер = ЭлементДанных.number;
	КонецЕсли;
	
	Если СуществующийОбъект.ТипДокумента = Перечисления.ТипыПервичныхДокументовЗЕРНО.ДекларацияСоответствия Тогда
		СуществующийОбъект.ДатаОкончания = ЭлементДанных.dateEnd;
	ИначеЕсли СуществующийОбъект.ТипДокумента = Перечисления.ТипыПервичныхДокументовЗЕРНО.ВетеринарныйСертификат Тогда
		СуществующийОбъект.ИдентификаторВЕТИС = ЭлементДанных.uuid;
		СуществующийОбъект.Серия              = ЭлементДанных.series;
		СуществующийОбъект.ВидДокумента       = ЭлементДанных.KindDoc;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СуществующийОбъект.ТипДокумента) Тогда
		ДанныеНаименования.Добавить(СуществующийОбъект.ТипДокумента);
	КонецЕсли;
	Если ЗначениеЗаполнено(СуществующийОбъект.Номер) Тогда
		ДанныеНаименования.Добавить(СтрШаблон(НСтр("ru = '№%1'"), СуществующийОбъект.Номер));
	КонецЕсли;
	Если ЗначениеЗаполнено(СуществующийОбъект.Дата) Тогда
		ДанныеНаименования.Добавить(СтрШаблон(НСтр("ru = 'от %1'"), Формат(СуществующийОбъект.Дата, "ДФ=dd.MM.yyyy;")));
	КонецЕсли;
	Если ДанныеНаименования.Количество() = 0 Тогда
		ДанныеНаименования.Добавить(НСтр("ru = '<Не указано>'"));
	КонецЕсли;
	
	СуществующийОбъект.Наименование = СтрСоединить(ДанныеНаименования, " ");
	СуществующийОбъект.Записать();
	
	ИнтеграцияЗЕРНОСлужебный.ОбновитьСсылку(ПараметрыОбмена, МетаданныеЭлемента.ПолноеИмя(), Идентификатор, СуществующийОбъект.Ссылка);
	
	Возврат СуществующийОбъект.Ссылка;
	
КонецФункции

Функция ДанныеПервичногоДокумента(ДанныеДокумента, ИмяПоля, Организация, Подразделение, ПараметрыОбмена)
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ТипДокумента",  Неопределено);
	ВозвращаемоеЗначение.Вставить("Идентификатор", Неопределено);
	ВозвращаемоеЗначение.Вставить("Данные",        ДанныеДокумента);
	
	ПараметрыТипа = ПараметрыОбмена.ПараметрыПреобразования.ТипыДокументовПоИменамСвойств[ИмяПоля];
	Если ПараметрыТипа = Неопределено Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	ПоляКлюча = ПоляСоставногоКлючаПоТипуПервичногоДокумента(ПараметрыТипа.ТипДокумента);
	Если ПараметрыТипа.ТипДокумента = Перечисления.ТипыПервичныхДокументовЗЕРНО.Товаросопроводительный Тогда
		ВозвращаемоеЗначение.ТипДокумента = ДанныеДокумента.KindDoc;
	ИначеЕсли ПараметрыТипа.ТипДокумента = Перечисления.ТипыПервичныхДокументовЗЕРНО.ПодтверждениеПраваСобственности Тогда
		ВозвращаемоеЗначение.ТипДокумента = Справочники.КлассификаторНСИЗЕРНО.КлассификаторНСИ(
			Перечисления.ВидыКлассификаторовЗЕРНО.ДокументПраваСобственности,
			ДанныеДокумента.KindDoc,
			Организация,
			Подразделение,
			ПараметрыОбмена);
	Иначе
		ВозвращаемоеЗначение.ТипДокумента = ПараметрыТипа.ТипДокумента;
		ДополнительноеЗначениеКлюча       = XMLСтрока(ПараметрыТипа.ТипДокумента);
	КонецЕсли;
	ВозвращаемоеЗначение.Идентификатор = ИнтеграцияЗЕРНОСлужебный.СоставнойКлючОбъекта(
		ВозвращаемоеЗначение.Данные, ПоляКлюча, ДополнительноеЗначениеКлюча);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПоляСоставногоКлючаПоТипуПервичногоДокумента(ТипДокумента = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Массив();
	
	Если ТипДокумента = Перечисления.ТипыПервичныхДокументовЗЕРНО.ДоговорХранения Тогда
		ВозвращаемоеЗначение.Добавить("numberDogovor");
		ВозвращаемоеЗначение.Добавить("dateDogovor");
	Иначе
		Если ТипДокумента = Перечисления.ТипыПервичныхДокументовЗЕРНО.Товаросопроводительный
			Или ТипДокумента = Перечисления.ТипыПервичныхДокументовЗЕРНО.ПодтверждениеПраваСобственности
			Или ТипДокумента = Перечисления.ТипыПервичныхДокументовЗЕРНО.ВетеринарныйСертификат Тогда
			ВозвращаемоеЗначение.Добавить("KindDoc");
		КонецЕсли;
		ВозвращаемоеЗначение.Добавить("number");
		ВозвращаемоеЗначение.Добавить("date");
		Если ТипДокумента = Перечисления.ТипыПервичныхДокументовЗЕРНО.ДекларацияСоответствия Тогда
			ВозвращаемоеЗначение.Добавить("dateEnd");
		ИначеЕсли ТипДокумента = Перечисления.ТипыПервичныхДокументовЗЕРНО.ВетеринарныйСертификат Тогда
			ВозвращаемоеЗначение.Добавить("series");
			ВозвращаемоеЗначение.Добавить("uuid");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
